[
{"park_name": ["Alagnak", "Alaska Public Lands", "Aleutian World War II", "Aniakchak", "Bering Land Bridge", "Cape Krusenstern", "Denali", "Gates Of The Arctic", "Glacier Bay", "Iñupiat Heritage Center", "Katmai", "Kenai Fjords", "Klondike Gold Rush", "Kobuk Valley", "Lake Clark", "Noatak", "Sitka", "World War II Valor in the Pacific", "Wrangell - St Elias", "Yukon - Charley Rivers"], "park_description": ["\nThe headwaters of Alagnak Wild River lie within the rugged Aleutian Range of neighboring Katmai National Park and Preserve. Meandering west towards Bristol Bay and the Bering Sea, the Alagnak traverses the beautiful Alaska Peninsula, providing an unparalleled opportunity to experience the unique wilderness, wildlife, and cultural heritage of southwest Alaska.\n", "\nAlaska’s parks, forests and refuges are rich and varied. The Anchorage Interagency Visitor Center helps visitors and residents to have meaningful, safe, enjoyable experiences on public lands, and encourages them to sustain the natural and cultural resources of Alaska. This center and three others statewide provide trip-planning, interpretation, and education for all ages.\n", "\nDuring World War II the remote Aleutian Islands, home to the Unangan (Aleut) people for over 8,000 years, became a fiercely contested battleground in the Pacific. This thousand-mile-long archipelago saw invasion by Japanese forces, the occupation of two islands; a mass relocation of Unangax civilians; a 15-month air war; and one of the deadliest battles in the Pacific Theater.\n", "\nGiven its remote location and challenging weather conditions, Aniakchak is one of the most wild and least visited in places in the National Park System. This landscape is a vibrant reminder of Alaska's location in the volcanically active \"Ring of Fire\" as it is home to an impressive six mile (10 km) wide, 2,500 ft (762 m) deep caldera formed during a massive volcanic eruption 3,500 years ago.\n", "\nImagine a place of whimsical beauty and larger-than-life landscapes: an ancestral home to ice-age giants and turbulent volcanic activity. A land that holds secrets to the intriguing history of human migration, sustains people that have lived here before its establishment as a preserve and continues to be part of a wide breadth of? traditions. Bering Land Bridge is unlike any other place on earth.\n", "\nNorth of the Arctic Circle, the monument forms 70 miles of shoreline on the Chukchi Sea.  More than 114 beach ridges provide evidence of human use for 5,000 years.  The Inupiat continue to use the area today.  Vast wetlands provide habitat for shorebirds from as far away as South America.  Hikers and boaters can see carpets of wildflowers among shrubs containing wisps of qiviut from muskoxen.\n", "\nDenali is six million acres of wild land, bisected by one ribbon of road. Travelers along it see the relatively low-elevation taiga forest give way to high alpine tundra and snowy mountains, culminating in North America's tallest peak, 20,310' Denali. Wild animals large and small roam un-fenced lands, living as they have for ages. Solitude, tranquility and wilderness await.\n", "\nThis vast landscape does not contain any roads or trails. Visitors discover intact ecosystems where people have lived with the land for thousands of years. Wild rivers meander through glacier-carved valleys, caribou migrate along age-old trails, endless summer light fades into aurora-lit night skies of winter. It remains virtually unchanged except by the forces of nature.\n", "\nCovering 3.3 million acres of rugged mountains, dynamic glaciers, temperate rainforest, wild coastlines and deep sheltered fjords, Glacier Bay National Park is a highlight of Alaska's Inside Passage and part of a 25-million acre World Heritage Site—one of the world’s largest international protected areas. From sea to summit, Glacier Bay offers limitless opportunities for adventure and inspiration.\n", "\nOn the rooftop of the world, the Iñupiat Heritage Center in Barrow, Alaska, tells the story of the Iñupiat people. They have thrived for thousands of years in one of the harshest climates on Earth, hunting the bowhead, or \"Agviq.\" In the 19th century, these lonely seas swarmed with commercial whalemen from New England, who also sought the bowhead for its valuable baleen and blubber.\n", "\nKatmai National Monument was established in 1918 to protect the volcanically devastated region surrounding Mount Katmai and the Valley of Ten Thousand Smokes. Today, Katmai National Park and Preserve remains an active volcanic landscape, but it also protects 9,000 years of human history as well as important habitat for salmon and thousands of brown bears.\n", "\nAt the edge of the Kenai Peninsula lies a land where the ice age lingers. Nearly 40 glaciers flow from the Harding Icefield, Kenai Fjords' crowning feature. Wildlife thrives in icy waters and lush forests around this vast expanse of ice. Native Alutiiq relied on these resources to nurture a life entwined with the sea. Today, shrinking glaciers bear witness to the effects of our changing climate.\n", "\n“Gold!” is what the headlines read in 1897, starting the Klondike Gold Rush. Thousands, hoping to ease the woes of economic depression, sold farms, dropped businesses and boarded ships to follow their dreams north. Today, the park commemorates the bravery of the stampeders who ventured north by protecting the trails, historic boomtowns and buildings of the Klondike Gold Rush era.\n", "\nCaribou, sand dunes, the Kobuk River, Onion Portage - just some of the facets of Kobuk Valley National Park. Half a million caribou migrate through, their tracks crisscrossing sculpted dunes. The Kobuk River is an ancient and current path for people and wildlife. For 9000 years, people came to Onion Portage to harvest caribou as they swam the river. Even today, that rich tradition continues.\n", "\nLake Clark National Park is a land of stunning beauty where volcanoes steam, salmon run, bears forage, craggy mountains reflect in shimmering turquoise lakes, and local people and culture still depend on the land and water of their home.  Solitude is found around every bend in the river and shoulder of a mountain.  Venture into the park to become part of the wilderness.\n", "\nAs one of North America's largest mountain-ringed river basins with an intact ecosystem, the Noatak River environs features some of the Arctic's finest arrays of plants and animals. The river is classified as a national wild and scenic river, and offers stunning wilderness float-trip opportunities - from deep in the Brooks Range to the tidewater of the Chukchi Sea.\n", "\nOn an island amid towering spruce and hemlock, Sitka National Historical Park preserves the site of a battle between invading Russian traders and indigenous Kiks.ádi Tlingit. Park visitors are awed by Tlingit and Haida totem poles standing along the park’s scenic coastal trail, and the restored Russian Bishop’s House speaks of Russia’s little known colonial legacy in North America.\n", "\nAt World War II Valor in the Pacific National Monument, home of the USS Arizona Memorial, learn about one of the most pivotal moments in US history: the attack on Pearl Harbor, and the subsequent entry of the United States into World War II. The monument preserves and interprets the stories of the Pacific War, from the internment of Japanese Americans to the battles in the Aleutians.\n", "\nWrangell St. Elias is a vast national park that rises from the ocean all the way up to 18,008 ft. Mount St. Elias. At 13.2 million acres, it’s the same size as Yellowstone Nat. Park, Yosemite Nat. Park, and Switzerland combined! Within this wild landscape, people continue to live off the land as they have done for centuries. This is a rugged, beautiful area filled with opportunities for adventure.\n", "\nLocated in Interior Alaska, Yukon-Charley Rivers offers exploration in a largely untouched landscape. Whether you float the mighty Yukon River or paddle the Charley River's whitewater, your memories will last a lifetime. Geology, cultural history, gold rush remnants, wildlife, and vast scenery will be a part of your experience. But, the strongest element will be solitude. Your adventure awaits.\n"]},
{"park_name": ["Alcatraz Island", "Cabrillo", "California", "Castle Mountains", "César E. Chávez", "Channel Islands", "Death Valley", "Devils Postpile", "Eugene O'Neill", "Fort Point", "Golden Gate", "John Muir", "Joshua Tree", "Juan Bautista de Anza", "Lassen Volcanic", "Lava Beds", "Manzanar", "Mojave", "Muir Woods", "Old Spanish", "Pinnacles", "Point Reyes", "Pony Express", "Port Chicago Naval Magazine", "Presidio of San Francisco", "Redwood", "Rosie the Riveter WWII Home Front", "San Francisco Maritime", "Santa Monica Mountains", "Sequoia & Kings Canyon", "Tule Lake Unit", "Whiskeytown", "World War II Valor in the Pacific", "Yosemite"], "park_description": ["\nAlcatraz Island offers a close-up look at the site of the first lighthouse and US built fort on the West Coast, the infamous federal penitentiary long off-limits to the public, and the history making 18 month occupation by Indians of All Tribes. Rich in history, there is also a natural side to the Rock—gardens, tide pools, bird colonies, and bay views beyond compare.\n", "\nClimbing out of his boat and onto shore in 1542, Juan Rodriguez Cabrillo stepped into history as the first European to set foot on what is now the West Coast of the United States. In addition to telling the story of 16th century exploration, the park is home to a wealth of cultural and natural resources. Join us and embark on your own Voyage of Discovery.\n", "\nFollow in the footsteps of over 250,000 emigrants who traveled to the gold fields and rich farmlands of California during the 1840s and 1850s-the greatest mass migration in American history. More than 1,000 miles of trail ruts and traces can still be seen across 10 states on the California National Historic Trail.\n", "\nCastle Mountains represents some of the most unique elements of the Mojave Desert. Nestled between the Nevada state line and Mojave National Preserve, the nearly 21,000 acres of Castle Mountains boasts Joshua tree forests, unbroken natural landscapes, rare desert grasslands, and rich human history. This intriguing area provides serenity and solitude from nearby metropolitan areas.\n", "\nYes, we can!\nWidely recognized as the most important Latino leader in the United States during the twentieth century, César E. Chávez led farm workers and supporters in the establishment of the country's first permanent agricultural union. His leadership brought sustained international attention to the plight of U.S. farm workers, and secured for them higher wages and safer working conditions\n", "\nChannel Islands National Park encompasses five remarkable islands and their ocean environment, preserving and protecting a wealth of natural and cultural resources. Isolation over thousands of years has created unique animals, plants, and archeological resources found nowhere else on Earth and helped preserve a place where visitors can experience coastal southern California as it once was.\n", "\nIn this below-sea-level basin, steady drought and record summer heat make Death Valley a land of extremes. Yet, each extreme has a striking contrast. Towering peaks are frosted with winter snow. Rare rainstorms bring vast fields of wildflowers. Lush oases harbor tiny fish and refuge for wildlife and humans. Despite its morbid name, a great diversity of life survives in Death Valley.\n", "\nEstablished in 1911 by presidential proclamation, Devils Postpile National Monument protects and preserves the Devils Postpile formation, the 101-foot high Rainbow Falls, and pristine mountain scenery.  The formation is a rare sight in the geologic world and ranks as one of the world's finest examples of columnar basalt. Its columns tower 60 feet high and display an unusual symmetry.\n", "\nAmerica's only Nobel Prize winning playwright, Eugene O'Neill, chose to live in Northern California at the height of his writing career. Isolated from the world and within the walls of his home, O'Neill wrote his final and most memorable plays; The Iceman Cometh, Long Day's Journey Into Night, and A Moon for the Misbegotten.\n", "\nFrom its vantage point overlooking the spectacular Golden Gate, Fort Point defended the San Francisco Bay following California's Gold Rush through World War II. Its beautifully arched casemates display the art of 3rd system brick masonry and interacts gracefully with the Golden Gate Bridge.\n", "\nThe park chronicles 200 years of history from Native American culture, Spanish Empire frontier, the Gold Rush, evolution of American coastal fortifications and growth of urban San Francisco. Comprised of 19 separate ecosystems and home to 1,273 plant/animal species, the park has hundreds of ways to recreate including horseback riding, ranger-led programs, bicycling, hiking and walking your dog.\n", "\nJohn Muir played many roles in his life, all of which helped him succeed in his role as an advocate for Nature. As America’s most famous naturalist and conservationist, Muir fought to protect the wild places he loved, places we can still visit today. Muir’s writings convinced the U.S. government to protect Yosemite, Sequoia, Grand Canyon and Mt. Rainier as national parks.\n", "\nTwo distinct desert ecosystems, the Mojave and the Colorado, come together in Joshua Tree National Park. A fascinating variety of plants and animals make their homes in a land sculpted by strong winds and occasional torrents of rain. Dark night skies, a rich cultural history, and surreal geologic features add to the wonder of this vast wilderness in southern California. Come explore for yourself.\n", "\n\"¡Vayan Subiendo!\"(\"Everyone mount up!\") was the rousing call from Juan Bautista de Anza. In 1775-76, Anza led some 240 men, women, and children on an epic journey to establish the first non-Native settlement at San Francisco Bay. Today, the 1,200-mile Juan Bautista de Anza National Historic Trail connects history, culture, and outdoor recreation from Nogales, Arizona, to the San Francisco Bay Are\n", "\nLassen Volcanic National Park is home to steaming fumaroles, meadows freckled with wildflowers, clear mountain lakes, and numerous volcanoes. Jagged peaks tell the story of its eruptive past while hot water continues to shape the land. Lassen Volcanic offers opportunities to discover the wonder and mysteries of volcanoes and hot water for visitors willing to explore the undiscovered.\n", "\nLava Beds National Monument is a land of turmoil, both geological and historical. Over the last half-million years, volcanic eruptions on the Medicine Lake shield volcano have created a rugged landscape dotted with diverse volcanic features. More than 700 caves, Native American rock art sites, historic battlefields and campsites, and a high desert wilderness experience await you!\n", "\nIn 1942, the United States government ordered more than 110,000 men, women, and children to leave their homes and detained them in remote, military-style camps. Manzanar War Relocation Center was one of ten camps where Japanese American citizens and resident Japanese aliens were interned during World War II.\n", "\nSinging sand dunes, volcanic cinder cones, Joshua tree forests, and carpets of wildflowers are all found at this 1.6 million acre park. A visit to its canyons, mountains and mesas will reveal long-abandoned mines, homesteads, and rock-walled military outposts. Located between Los Angeles and Las Vegas, Mojave provides serenity and solitude from major metropolitan areas.\n", "\nWalk among old growth coast redwoods, cooling their roots in the fresh water of Redwood Creek and lifting their crowns to reach the sun and fog. Federally protected as a National Monument since 1908, this primeval forest is both refuge and laboratory, revealing our relationship with the living landscape. What will you discover in Muir Woods?\n", "\nFollow the routes of mule pack trains across the Southwest on the Old Spanish National Historic Trail between Santa Fe, New Mexico, and Los Angeles, California. New Mexican traders moved locally produced merchandise across what are now six states to exchange for mules and horses.\n", "\nSome 23 million years ago multiple volcanoes erupted, flowed, and slid to form what would become Pinnacles National Park. What remains is a unique landscape. Travelers journey through chaparral, oak woodlands, and canyon bottoms. Hikers enter rare talus caves and emerge to towering rock spires teeming with life: prairie and peregrine falcons, golden eagles, and the inspiring California condor.\n", "\nFrom its thunderous ocean breakers crashing against rocky headlands and expansive sand beaches to its open grasslands, brushy hillsides, and forested ridges, Point Reyes offers visitors over 1500 species of plants and animals to discover. Home to several cultures over thousands of years, the Seashore preserves a tapestry of stories and interactions of people. Point Reyes awaits your exploration.\n", "\nIt is hard to believe that young men once rode horses to carry mail from Missouri to California in the unprecedented time of only 10 days. This relay system along the Pony Express National Historic Trail in eight states was the most direct and practical means of east-west communications before the telegraph.\n", "\nOn the evening of July 17, 1944, residents in the San Francisco east bay area were jolted awake by a massive explosion that cracked windows and lit up the night sky. At Port Chicago Naval Magazine, 320 men were instantly killed when two ships being loaded with ammunition for the Pacific theater troops blew up. It was WWII's worst home front disaster.\n", "\nFor 218 years, the Presidio served as an army post for three nations. World and local events, from military campaigns to World Fairs and earthquakes, left their mark. Come enjoy the history and the natural beauty of the Presidio. Explore centuries of architecture. Reflect in a national cemetery. Walk along an historic airfield, through forests or to beaches, and admire spectacular vistas.\n", "\nMost people know Redwood as home to the tallest trees on Earth. The parks also protect vast prairies, oak woodlands, wild riverways, and nearly 40 miles of rugged coastline.  For thousands of years people have lived in this verdant landscape.  Together, the National Park Service and California State Parks manage these lands for the inspiration, enjoyment, and education of all.\n", "\nExplore and honor the efforts and sacrifices of American civilians on the World War II home front.  Find out how they lived, worked and got along. Many faces, many stories, many truths weave a complex tapestry of myths and realities from this time of opportunity and loss.\n", "\nStand on the stern of Balclutha, face west to feel the fresh wind blowing in from the Pacific Ocean. Located in the Fisherman's Wharf neighborhood, San Francisco Maritime National Historical Park offers the sights, sounds, smells and stories of Pacific Coast maritime history.\n", "\nHidden in plain sight from Los Angeles, the Santa Monica Mountains offer easy access to surprisingly wild places. Experience the famous beaches of Malibu or explore more than 500 miles of trails. The park abounds with historical and cultural sites, from old movie ranches to Native American centers. What will you and your family discover?\n", "\nThis dramatic landscape testifies to nature's size, beauty, and diversity--huge mountains, rugged foothills, deep canyons, vast caverns, and the world's largest trees. These two parks lie side by side in the southern Sierra Nevada east of the San Joaquin Valley. Weather varies a lot by season and elevation, which ranges from 1,370' to 14,494'. Sequoias grow at 5,000 - 7,000', above usual snowline.\n", "\nThe Tule Lake Unit, WWII Valor in the Pacific National Monument includes both the the Tule Lake Segregation Center, the largest and most controversial of the sites where Japanese Americans were incarcerated during World War II, and Camp Tulelake, which was first a Civilian Conservation Corps camp, then a prisoner of war camp, and finally an additional facility to detain Japanese Americans.\n", "\nWhiskeytown Lake’s beautiful crystal-clear waters, surrounded by mountain peaks, are perhaps the most prominent feature of the park.  However, water-based recreation is only a small part of what the park has to offer. The 39,000 acres surrounding the lake hold four waterfalls, pristine mountain creeks, 70 miles of trails, and opportunities to explore the history of the California Gold Rush.\n", "\nAt World War II Valor in the Pacific National Monument, home of the USS Arizona Memorial, learn about one of the most pivotal moments in US history: the attack on Pearl Harbor, and the subsequent entry of the United States into World War II. The monument preserves and interprets the stories of the Pacific War, from the internment of Japanese Americans to the battles in the Aleutians.\n", "\nNot just a great valley, but a shrine to human foresight, the strength of granite, the power of glaciers, the persistence of life, and the tranquility of the High Sierra.\nFirst protected in 1864, Yosemite National Park is best known for its waterfalls, but within its nearly 1,200 square miles, you can find deep valleys, grand meadows, ancient giant sequoias, a vast wilderness area, and much more.\n"]}
]